app/views/firms/index.html.erb

SELECT AVG(`recommendations`.`rating`) AS avg_id FROM `recommendations` WHERE `recommendations`.`firm_id` = 1
---
    <td><%= firm.name  %></td>
    <td><%= '   Средняя оценка:   ' + firm.Recommendations.average(:rating).to_s %></td>