app/controllers/firms_controller.rb

SELECT `firms`.* FROM `firms`
---
  def index
    @firms = Firm.all

SELECT `firms`.* FROM `firms` WHERE `firms`.`id` = 1 LIMIT 1
---
  def show
    @firm = Firm.find(params[:id])

SELECT `firms`.* FROM `firms` WHERE `firms`.`id` = 1 LIMIT 1
---
  def edit
    @firm = Firm.find(params[:id])

INSERT INTO `firms` (`created_at`, `name`, `updated_at`) VALUES ('2011-10-19 08:16:34', 'Таджики Инкорпорейтед', '2011-10-19 08:16:34')
---
  def create
    @firm = Firm.new(params[:firm])

    respond_to do |format|
      if @firm.save

SELECT `firms`.* FROM `firms` WHERE `firms`.`id` = 1 LIMIT 1
UPDATE `firms` SET `name` = 'Таджики Инк', `updated_at` = '2011-10-19 08:16:47' WHERE `firms`.`id` = 1
INSERT INTO `recommendations` (`created_at`, `firm_id`, `rating`, `updated_at`) VALUES ('2011-10-19 08:41:16', 1, NULL, '2011-10-19 08:41:16')
---
  def update
    @firm = Firm.find(params[:id])

    respond_to do |format|
      if @firm.update_attributes(params[:firm])
        @recommend = Recommendation.new()
        @recommend.rating = params[:rating]
        @firm.Recommendations << @recommend

SELECT `firms`.* FROM `firms` WHERE `firms`.`id` = 3 LIMIT 1
DELETE FROM `firms` WHERE `firms`.`id` = 3
---
  def destroy
    @firm = Firm.find(params[:id])
    @firm.destroy